create_library_set \
    -name SSG0v81m40 \
    -timing " \
        ../in/lib/scc28nhkcp_hsc30p140_rvt_ssg_v0p81_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc30p140_lvt_ssg_v0p81_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc30p140_ulvt_ssg_v0p81_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_hvt_ssg_v0p81_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_rvt_ssg_v0p81_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_lvt_ssg_v0p81_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_ulvt_ssg_v0p81_-40c_ccs.lib" \
    -aocv " \
        ../in/aocv/scc28nhkcp_hsc30p140_rvt_ssg_v0p81_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc30p140_lvt_ssg_v0p81_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc30p140_ulvt_ssg_v0p81_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_hvt_ssg_v0p81_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_rvt_ssg_v0p81_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_lvt_ssg_v0p81_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_ulvt_ssg_v0p81_-40c.aocv" \
    -si " \
        ../in/cdb/scc28nhkcp_hsc30p140_rvt_ssg_v0p81_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc30p140_lvt_ssg_v0p81_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc30p140_ulvt_ssg_v0p81_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_hvt_ssg_v0p81_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_rvt_ssg_v0p81_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_lvt_ssg_v0p81_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_ulvt_ssg_v0p81_-40c.cdb"
create_library_set \
    -name FFG0v99m40 \
    -timing " \
        ../in/lib/scc28nhkcp_hsc30p140_rvt_ffg_v0p99_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc30p140_lvt_ffg_v0p99_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc30p140_ulvt_ffg_v0p99_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_hvt_ffg_v0p99_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_rvt_ffg_v0p99_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_lvt_ffg_v0p99_-40c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_ulvt_ffg_v0p99_-40c_ccs.lib" \
    -aocv " \
        ../in/aocv/scc28nhkcp_hsc30p140_rvt_ffg_v0p99_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc30p140_lvt_ffg_v0p99_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc30p140_ulvt_ffg_v0p99_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_hvt_ffg_v0p99_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_rvt_ffg_v0p99_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_lvt_ffg_v0p99_-40c.aocv \
        ../in/aocv/scc28nhkcp_hsc35p140_ulvt_ffg_v0p99_-40c.aocv" \
    -si " \
        ../in/cdb/scc28nhkcp_hsc30p140_rvt_ffg_v0p99_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc30p140_lvt_ffg_v0p99_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc30p140_ulvt_ffg_v0p99_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_hvt_ffg_v0p99_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_rvt_ffg_v0p99_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_lvt_ffg_v0p99_-40c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_ulvt_ffg_v0p99_-40c.cdb"
create_library_set \
    -name TT0v9025 \
    -timing " \
        ../in/lib/scc28nhkcp_hsc30p140_rvt_tt_v0p9_25c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc30p140_lvt_tt_v0p9_25c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc30p140_ulvt_tt_v0p9_25c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_hvt_tt_v0p9_25c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_rvt_tt_v0p9_25c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_lvt_tt_v0p9_25c_ccs.lib \
        ../in/lib/scc28nhkcp_hsc35p140_ulvt_tt_v0p9_25c_ccs.lib" \
    -si " \
        ../in/cdb/scc28nhkcp_hsc30p140_rvt_tt_v0p9_25c.cdb \
        ../in/cdb/scc28nhkcp_hsc30p140_lvt_tt_v0p9_25c.cdb \
        ../in/cdb/scc28nhkcp_hsc30p140_ulvt_tt_v0p9_25c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_hvt_tt_v0p9_25c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_rvt_tt_v0p9_25c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_lvt_tt_v0p9_25c.cdb \
        ../in/cdb/scc28nhkcp_hsc35p140_ulvt_tt_v0p9_25c.cdb"

create_timing_condition \
    -name func_SSG0v81m40cw_s \
    -library_sets "SSG0v81m40"
create_timing_condition \
    -name func_SSG0v81m40cw_h \
    -library_sets "SSG0v81m40"
create_timing_condition \
    -name func_FFG0v99m40cb_h \
    -library_sets "FFG0v99m40"
create_timing_condition \
    -name func_TT0v9025ct_s \
    -library_sets "TT0v9025"
create_timing_condition \
    -name func_TT0v9025ct_h \
    -library_sets "TT0v9025"

create_rc_corner \
    -name cw_m40 \
    -temperature -40 \
    -qrc_tech /auto/foundry/SMIC/20250725/SMIC_CCIQRC_28HKCPlusLG_0918_1P10M_8Ic_1TMc_1MTTc_ALPA2_V1.0_REV5_0/rulefiles/CMAX/qrcTechFile
create_rc_corner \
    -name cb_m40 \
    -temperature -40 \
    -qrc_tech /auto/foundry/SMIC/20250725/SMIC_CCIQRC_28HKCPlusLG_0918_1P10M_8Ic_1TMc_1MTTc_ALPA2_V1.0_REV5_0/rulefiles/CMIN/qrcTechFile
create_rc_corner \
    -name ct_25 \
    -temperature 25 \
    -qrc_tech /auto/foundry/SMIC/20250725/SMIC_CCIQRC_28HKCPlusLG_0918_1P10M_8Ic_1TMc_1MTTc_ALPA2_V1.0_REV5_0/rulefiles/TYPICAL/qrcTechFile

create_delay_corner \
    -name func_SSG0v81m40cw_s \
    -timing_condition func_SSG0v81m40cw_s \
    -rc_corner cw_m40
create_delay_corner \
    -name func_SSG0v81m40cw_h \
    -timing_condition func_SSG0v81m40cw_h \
    -rc_corner cw_m40
create_delay_corner \
    -name func_FFG0v99m40cb_h \
    -timing_condition func_FFG0v99m40cb_h \
    -rc_corner cb_m40
create_delay_corner \
    -name func_TT0v9025ct_s \
    -timing_condition func_TT0v9025ct_s \
    -rc_corner ct_25
create_delay_corner \
    -name func_TT0v9025ct_h \
    -timing_condition func_TT0v9025ct_h \
    -rc_corner ct_25

create_constraint_mode \
    -name func \
    -sdc_files "../in/sdc/func_clocks.sdc ../in/sdc/func_io.sdc"

create_analysis_view \
    -name func_SSG0v81m40cw_s \
    -constraint_mode func \
    -delay_corner func_SSG0v81m40cw_s
create_analysis_view \
    -name func_SSG0v81m40cw_h \
    -constraint_mode func \
    -delay_corner func_SSG0v81m40cw_h
create_analysis_view \
    -name func_FFG0v99m40cb_h \
    -constraint_mode func \
    -delay_corner func_FFG0v99m40cb_h
create_analysis_view \
    -name func_TT0v9025ct_s \
    -constraint_mode func \
    -delay_corner func_TT0v9025ct_s
create_analysis_view \
    -name func_TT0v9025ct_h \
    -constraint_mode func \
    -delay_corner func_TT0v9025ct_h

set_analysis_view -setup " func_SSG0v81m40cw_s func_TT0v9025ct_s" -hold " func_SSG0v81m40cw_s func_TT0v9025ct_s  func_SSG0v81m40cw_h func_FFG0v99m40cb_h func_TT0v9025ct_h "
